other-paperwork/pid/pid.org
#+TITLE: Project Initiation Document
#+AUTHOR: Benjamin Moore
#+OPTIONS: toc:nil

#+LATEX_HEADER: \usepackage{adjustbox}

* Introduction
  Throughout the past few years blockchain has moved from relative obscurity to 
  a dominant technology that is being adopted for various uses throughout many industries
  but it's first application, Bitcoin is still currently the most used application of the
  technology. My project aims to create a Bitcoin wallet application for the Android smartphone
  creating a mobile interface for the Bitcoin blockchain that users can carry around in their pockets
  although there are other applications that also provide Bitcoin wallet, most notably Coinbase's mobile
  application the market for android wallet applications is still relatively small and some are even choosing 
  to forgo decentralisation to create a simpler seeming application. My project will aim to create an interface 
  for the android operating system which is not tied to any single company and can still give users the ease of use 
  of other wallet applications while still providing transparency and not forgoing the core tenant of decentralisation
  that Bitcoin was initially designed to uphold.


* Background and Motivation
   As someone with an avid interest in crypto currency I have found there are not many android Bitcoin applications available 
   and although there are some good options and the current most popular application is tied too Coinbase, the current largest 
   cryptocurrency exchange. My wallet application will attempt to create something which can provide an interface to both technical 
   and non-technical users while also remaining not tied to any company or exchange allowing the system to remain decentralised. 
   While my wallet will not be tied to any company or person in the blockchain space my application will aim to provide a simple 
   interface for the Bitcoin blockchain while allowing users to keep their funds on their own device as opposed to keeping them 
   on an external server owned by a third party company.


* Project Objectives
** To analyse potential android development methodologies  
** To build an understand of how an application interfaces with a blockchain
** To implement a system that communicates with the Bitcoin blockchain effectively
** To implement a system that allows users of non-technical backgrounds to also utilise the Bitcoin blockchain
   

* Initial Scope
** Core Deliverables
  The proposed application will aim to have the following features
**** Setting up a new wallet for a user
**** Allowing for sending and receiving of Bitcoin transactions
**** Providing the ability to recover a wallet using a private key
** Desired features
*** Allowing the user to view the current price of Bitcoin in GBP or USD before sending their transaction
*** Allowing an interface with other blockchain assets such as Ethereum
*** Providing an extra layer of security for users such as using biometrics built into the mobile device


* Resources and Dependencies
 There are no external resources required for the completion of this project


* Method of Approach
 When approaching this project I will be utilising an agile development methodology while using a kanban board for
 listing issues and features that require completion, starting with the features in this order.
** A user can create a wallet with a bitcoin address
** A user can send Bitcoin transactions
** A user can receive Bitcoin transactions
