other-paperwork/pid/pid.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-12-11 Tue 15:25 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Project Initiation Document</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Benjamin Moore" />
</head>
<body>
<div id="content">
<h1 class="title">Project Initiation Document</h1>

<div id="outline-container-org1baa8b6" class="outline-2">
<h2 id="org1baa8b6"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
Throughout the past few years blockchain has moved from relative obscurity to 
a dominant technology that is being adopted for various uses throughout many industries
but it's first application, Bitcoin is still currently the most used application of the
technology. My project aims to create a Bitcoin wallet application for the Android smartphone
creating a mobile interface for the Bitcoin blockchain that users can carry around in their pockets
although there are other applications that also provide Bitcoin wallet, most notably Coinbase's mobile
application the market for android wallet applications is still relatively small and some are even choosing 
to forgo decentralisation to create a simpler seeming application. My project will aim to create an interface 
for the android operating system which is not tied to any single company and can still give users the ease of use 
of other wallet applications while still providing transparency and not forgoing the core tenant of decentralisation
that Bitcoin was initially designed to uphold.
</p>
</div>
</div>


<div id="outline-container-org84c28d7" class="outline-2">
<h2 id="org84c28d7"><span class="section-number-2">2</span> Background and Motivation</h2>
<div class="outline-text-2" id="text-2">
<p>
As someone with an avid interest in crypto currency I have found there are not many android Bitcoin applications available 
and although there are some good options and the current most popular application is tied too Coinbase, the current largest 
cryptocurrency exchange. My wallet application will attempt to create something which can provide an interface to both technical 
and non-technical users while also remaining not tied to any company or exchange allowing the system to remain decentralised. 
While my wallet will not be tied to any company or person in the blockchain space my application will aim to provide a simple 
interface for the Bitcoin blockchain while allowing users to keep their funds on their own device as opposed to keeping them 
on an external server owned by a third party company.
</p>
</div>
</div>


<div id="outline-container-org30c9497" class="outline-2">
<h2 id="org30c9497"><span class="section-number-2">3</span> Project Objectives</h2>
<div class="outline-text-2" id="text-3">
</div>
<ol class="org-ol">
<li><a id="org4314d3e"></a>To analyse potential android development methodologies<br /></li>
<li><a id="org019cdbc"></a>To build an understand of how an application interfaces with a blockchain<br /></li>
<li><a id="orgc544dbd"></a>To implement a system that communicates with the Bitcoin blockchain effectively<br /></li>
<li><a id="org5787c5b"></a>To implement a system that allows users of non-technical backgrounds to also utilise the Bitcoin blockchain<br /></li>
</ol>
</div>


<div id="outline-container-org8e13d29" class="outline-2">
<h2 id="org8e13d29"><span class="section-number-2">4</span> Initial Scope</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orge20dbde" class="outline-3">
<h3 id="orge20dbde"><span class="section-number-3">4.1</span> Core Deliverables</h3>
<div class="outline-text-3" id="text-4-1">
<p>
The proposed application will aim to have the following features
</p>
</div>
<ol class="org-ol">
<li><a id="orgc3a1e64"></a>Setting up a new wallet for a user<br /></li>
<li><a id="orgedecf72"></a>Allowing for sending and receiving of Bitcoin transactions<br /></li>
<li><a id="org3b4d821"></a>Providing the ability to recover a wallet using a private key<br /></li>
</ol>
</div>
<div id="outline-container-org51cefc2" class="outline-3">
<h3 id="org51cefc2"><span class="section-number-3">4.2</span> Desired features</h3>
<div class="outline-text-3" id="text-4-2">
</div>
<ol class="org-ol">
<li><a id="orgbd1276c"></a>Allowing the user to view the current price of Bitcoin in GBP or USD before sending their transaction<br /></li>
<li><a id="orgfb97921"></a>Allowing an interface with other blockchain assets such as Ethereum<br /></li>
<li><a id="org6209607"></a>Providing an extra layer of security for users such as using biometrics built into the mobile device<br /></li>
</ol>
</div>
</div>


<div id="outline-container-orga4b8134" class="outline-2">
<h2 id="orga4b8134"><span class="section-number-2">5</span> Resources and Dependencies</h2>
<div class="outline-text-2" id="text-5">
<p>
There are no external resources required for the completion of this project
</p>
</div>
</div>


<div id="outline-container-orga34a3d3" class="outline-2">
<h2 id="orga34a3d3"><span class="section-number-2">6</span> Method of Approach</h2>
<div class="outline-text-2" id="text-6">
<p>
When approaching this project I will be utilising an agile development methodology while using a kanban board for
listing issues and features that require completion, starting with the features in this order.
</p>
</div>
<ol class="org-ol">
<li><a id="org4006a4b"></a>A user can create a wallet with a bitcoin address<br /></li>
<li><a id="org30acfa3"></a>A user can send Bitcoin transactions<br /></li>
<li><a id="org23f3403"></a>A user can receive Bitcoin transactions<br /></li>
