other-paperwork/pid/pid.tex
% Created 2018-12-10 Mon 19:32
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{adjustbox}
\author{Benjamin Moore}
\date{\today}
\title{Project Initiation Document}
\hypersetup{
 pdfauthor={Benjamin Moore},
 pdftitle={Project Initiation Document},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.1 (Org mode 9.1.14)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section{Introduction}
\label{sec:org87c92f7}
Throughout the past few years blockchain has moved from relative obscurity to 
a dominant technology that is being adopted for various uses throughout many industries
but it's first application, Bitcoin is still currently the most used application of the
technology. My project aims to create a Bitcoin wallet application for the Android smartphone
creating a mobile interface for the Bitcoin blockchain that users can carry around in their pockets
although there are other applications that also provide Bitcoin wallet, most notably Coinbase's mobile
application the market for android wallet applications is still relatively small and some are even choosing 
to forgo decentralisation to create a simpler seeming application. My project will aim to create an interface 
for the android operating system which is not tied to any single company and can still give users the ease of use 
of other wallet applications while still providing transparency and not forgoing the core tenant of decentralisation
that Bitcoin was initially designed to uphold.


\section{Background and Motivation}
\label{sec:orgdbdb4f8}
As someone with an avid interest in crypto currency I have found there are not many android Bitcoin applications available 
and although there are some good options and the current most popular application is tied too Coinbase, the current largest 
cryptocurrency exchange. My wallet application will attempt to create something which can provide an interface to both technical 
and non-technical users while also remaining not tied to any company or exchange allowing the system to remain decentralised. 
While my wallet will not be tied to any company or person in the blockchain space my application will aim to provide a simple 
interface for the Bitcoin blockchain while allowing users to keep their funds on their own device as opposed to keeping them 
on an external server owned by a third party company.


\section{Project Objectives}
\label{sec:orgba6285c}
\subsection{To analyse potential android development methodologies}
\label{sec:org7823110}
\subsection{To build an understand of how an application interfaces with a blockchain}
\label{sec:org24b3956}
\subsection{To implement a system that communicates with the Bitcoin blockchain effectively}
\label{sec:org2f32b0e}
\subsection{To implement a system that allows users of non-technical backgrounds to also utilise the Bitcoin blockchain}
\label{sec:org3430e6a}


\section{Initial Scope}
\label{sec:orga45b262}
\subsection{Core Deliverables}
\label{sec:orgccfe72b}
The proposed application will aim to have the following features
\begin{enumerate}
\item Setting up a new wallet for a user
\label{sec:org511c7f4}
\item Allowing for sending and receiving of Bitcoin transactions
\label{sec:org3f569d6}
\item Providing the ability to recover a wallet using a private key
\label{sec:org0f05e87}
\end{enumerate}
\subsection{Desired features}
\label{sec:org311bc54}
\subsubsection{Allowing the user to view the current price of Bitcoin in GBP or USD before sending their transaction}
\label{sec:org77a2a9e}
\subsubsection{Allowing an interface with other blockchain assets such as Ethereum}
\label{sec:orgf60c4d8}
\subsubsection{Providing an extra layer of security for users such as using biometrics built into the mobile device}
\label{sec:orgad38573}


\section{Resources and Dependencies}
\label{sec:orgb808604}
There are no external resources required for the completion of this project


\section{Method of Approach}
\label{sec:org755554d}
When approaching this project I will be utilising an agile development methodology while using a kanban board for
listing issues and features that require completion, starting with the features in this order.
\subsection{A user can create a wallet with a bitcoin address}
\label{sec:orgb63f69e}
\subsection{A user can send Bitcoin transactions}
\label{sec:org34be1ef}
\subsection{A user can receive Bitcoin transactions}
\label{sec:org5152bf4}
