other-paperwork/pid/pid.org
** A user can recover their funds in the event of losing their device

 Further increments may be added to develop desirable functionality dependant on time.

 After researching various development technologies for this project I have decided that I will be using the Kotlin programming language
 which Google is supporting as the new primary language for the development of android applications. As the focus of this project is an Android
 application it would be desirable to utilise the most modern technologies for building apps for the platform. Kotlin also provides interpolation
 with java libraries allowing for the use of older Android libraries if needed. Kotlin also allows for the use of features like anonymous and higher-order functions
 allowing for programming in a functional style. This will be useful when dealing with a financial application as it will allow me to utilise
 asynchronous functions while not having to worry about bugs which are related to race-conditions, through trying to achieve function purity 
 in as many core functions as possible, I will attempt to achieve better security through good programming practices.


* Project Plan
  #+begin_table
  #+LATEX: \caption{Project Plan}
  #+LATEX: \label{tab:project-plan}
  #+LATEX: \centering
  #+LATEX: \adjustbox{width=\textwidth}{
  #+ATTR_LATEX: :center t :placement [h]
  |----------------------------------------------------------------+---------------------+--------------------------+--------------------------------------------------|
  | Stage                                                          | Expected Start Date | Expected Completion Date | Products/deliverables/outcomes                   |
  |----------------------------------------------------------------+---------------------+--------------------------+--------------------------------------------------|
  | <>                                                             | <>                  | <>                       | <>                                               |
  | 1. Initiation                                                  |                     | 14/12/18                 | PID Final Draft                                  |
  | 2. Initial High level design and requirements analysis         | 28/01/19            | 03/02/19                 | Design architecture and HCI                      |
  | 3. Phase One                                                   | 04/02/19            | 10/02/19                 | Develop wallet creation functionality            |
  | 3. Phase One                                                   | 11/02/19            | 17/02/19                 | Develop address viewing functionality            |
  | 4. Phase Two                                                   | 18/02/19            | 24/02/19                 | Develop ability to receive Bitcoin               |
  | 5. Phase Three                                                 | 25/02/19            | 03/03/19                 | Develop ability to view wallet balance           |
  | 6. Phase Four                                                  | 04/03/19            | 10/03/19                 | Develop ability to send Bitcoin                  |
  | 7. Phase Five                                                  | 11/03/19            | 17/03/19                 | Develop recovery functionality using private key |
  | Easter Holiday (Using this time to develop desirable features) | 08/04/19            | 28/04/19                 |                                                  |
  | 8. User Testing                                                | 29/04/19            | 05/05/19                 | User testing and codebase refactoring            |
  | 9. Writing Report                                              | 06/05/19            | 12/05/19                 | Draft Report                                     |
  | 10. Assemble code and complete report final draft              | 13/05/19            | 19/05/19                 | Final report and code submission                 |
  |----------------------------------------------------------------+---------------------+--------------------------+--------------------------------------------------|
  #+end_table

* Control Plan
  Throughout the completion of the project the following control techniques will be utilised
** Highlight reports to be submitted as described by the PRCO304 project brief
** Weekly meetings reviewing my progress with my project supervisor (Dr. Ismini Vasileiou) as described by the PRCO304 project brief allowing for periodical reviewing of my progress
** Utilisation of my risk management plan, project plan and, other contingency plans.


