other-paperwork/pid/pid.html
<li><a id="org5f40e64"></a>A user can recover their funds in the event of losing their device<br />
<div class="outline-text-5" id="text-6-0-0-4">
<p>
Further increments may be added to develop desirable functionality dependant on time.
After researching various development technologies for this project I have decided that I will be using the Kotlin programming language
which Google is supporting as the new primary language for the development of android applications. As the focus of this project is an Android
application it would be desirable to utilise the most modern technologies for building apps for the platform. Kotlin also provides interpolation
with java libraries allowing for the use of older Android libraries if needed. Kotlin also allows for the use of features like anonymous and higher-order functions
allowing for programming in a functional style. This will be useful when dealing with a financial application as it will allow me to utilise
asynchronous functions while not having to worry about bugs which are related to race-conditions, through trying to achieve function purity 
in as many core functions as possible, I will attempt to achieve better security through good programming practices.
</p>
</div>
</li>
</ol>
</div>


<div id="outline-container-orgf773ab1" class="outline-2">
<h2 id="orgf773ab1"><span class="section-number-2">7</span> Project Plan</h2>
<div class="outline-text-2" id="text-7">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Stage</th>
<th scope="col" class="org-left">Expected Start Date</th>
<th scope="col" class="org-left">Expected Completion Date</th>
<th scope="col" class="org-left">Products/deliverables/outcomes</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">1. Initiation</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">14/12/18</td>
<td class="org-left">PID Final Draft</td>
</tr>

<tr>
<td class="org-left">2. Initial High level design and requirements analysis</td>
<td class="org-left">28/01/19</td>
<td class="org-left">03/02/19</td>
<td class="org-left">Design architecture and HCI</td>
</tr>

<tr>
<td class="org-left">3. Phase One</td>
<td class="org-left">04/02/19</td>
<td class="org-left">10/02/19</td>
<td class="org-left">Develop wallet creation functionality</td>
</tr>

<tr>
<td class="org-left">3. Phase One</td>
<td class="org-left">11/02/19</td>
<td class="org-left">17/02/19</td>
<td class="org-left">Develop address viewing functionality</td>
</tr>

<tr>
<td class="org-left">4. Phase Two</td>
<td class="org-left">18/02/19</td>
<td class="org-left">24/02/19</td>
<td class="org-left">Develop ability to receive Bitcoin</td>
</tr>

<tr>
<td class="org-left">5. Phase Three</td>
<td class="org-left">25/02/19</td>
<td class="org-left">03/03/19</td>
<td class="org-left">Develop ability to view wallet balance</td>
</tr>

<tr>
<td class="org-left">6. Phase Four</td>
<td class="org-left">04/03/19</td>
<td class="org-left">10/03/19</td>
<td class="org-left">Develop ability to send Bitcoin</td>
</tr>

<tr>
<td class="org-left">7. Phase Five</td>
<td class="org-left">11/03/19</td>
<td class="org-left">17/03/19</td>
<td class="org-left">Develop recovery functionality using private key</td>
</tr>

<tr>
<td class="org-left">Easter Holiday (Using this time to develop desirable features)</td>
<td class="org-left">08/04/19</td>
<td class="org-left">28/04/19</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">8. User Testing</td>
<td class="org-left">29/04/19</td>
<td class="org-left">05/05/19</td>
<td class="org-left">User testing and codebase refactoring</td>
</tr>

<tr>
<td class="org-left">9. Writing Report</td>
<td class="org-left">06/05/19</td>
<td class="org-left">12/05/19</td>
<td class="org-left">Draft Report</td>
</tr>

<tr>
<td class="org-left">10. Assemble code and complete report final draft</td>
<td class="org-left">13/05/19</td>
<td class="org-left">19/05/19</td>
<td class="org-left">Final report and code submission</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-orga7e5431" class="outline-2">
<h2 id="orga7e5431"><span class="section-number-2">8</span> Control Plan</h2>
<div class="outline-text-2" id="text-8">
<p>
Throughout the completion of the project the following control techniques will be utilised
</p>
</div>
<ol class="org-ol">
<li><a id="orgb213df9"></a>Highlight reports to be submitted as described by the PRCO304 project brief<br /></li>
<li><a id="orgdace907"></a>Weekly meetings reviewing my progress with my project supervisor (Dr. Ismini Vasileiou) as described by the PRCO304 project brief allowing for periodical reviewing of my progress<br /></li>
<li><a id="org265b6f5"></a>Utilisation of my risk management plan, project plan and, other contingency plans.<br /></li>
</ol>
</div>
