other-paperwork/pid/pid.org
* Initial Risk List
#+begin_table
#+LATEX: \caption{Initial risk List}
#+LATEX: \label{tab:risk-list}
#+LATEX: \centering
#+LATEX: \adjustbox{max width=\textwidth}{
#+ATTR_LATEX: :center t :placement [h]
|--------------------------------------------------------------+-------------------------------------------------------------------------------------------------------------------|
| Risk                                                         | Management Strategy                                                                                               |
|--------------------------------------------------------------+-------------------------------------------------------------------------------------------------------------------|
| <>                                                           | <>                                                                                                                |
| Technology failure, loss of data                             | In the event that I have a technology failure I will be using Git as my version control system                    |
|                                                              | while also using Github as a repository hosting solution                                                          |
| Schedule Overrun                                             | Schedule Overrun has been considered as part of this project, I have left time free during my                     |
|                                                              | Easter break (08/04/19 to 28/04/19) to be used to catch up with any overrun if it is needed                       |
| Difficultly learning how to use the development technologies | As I have not developed a blockchain application or developed with Kotlin before, but as I feel                   |
|                                                              | I am a competent developer I should be able to utilise the extensive documentation online to overcome this issue. |
|                                                              | I have also planned for overrun in my project plan which will allow me to catch up if needed                      |
| Illness, family emergency                                    | In the event of illness or family emergency, I will contact my project supervisor.                                |
|                                                              | If necessary I will apply for extenuating circumstances.                                                          |
|--------------------------------------------------------------+-------------------------------------------------------------------------------------------------------------------|
#+end_table


* Initial Quality Plan
#+begin_table
#+LATEX: \caption{Initial Quality Plan}
#+LATEX: \label{tab:quality-plan}
#+LATEX: \centering
#+LATEX: \adjustbox{max width=\linewidth}{
#+ATTR_LATEX: :center t :placement [h]
|----------------------------+--------------------------------------------------------------------------------------------------------------------------------|
| Quality Check              | Strategy                                                                                                                       |
|----------------------------+--------------------------------------------------------------------------------------------------------------------------------|
| <>                         | <>                                                                                                                             |
| Requirements               | Requirements will be checked reviewed to check they are correct and adhere to the project objectives as well as being correct, |
|                            | complete and, achievable as these requirements will indicate the criteria of the resulting product.                            |
|                            | Prototypes will be built and assessed by other stakeholders (friends, users and colleagues)                                    |
| Design Validation          | Throughout the project I will constantly evaluate the project on the delivery of every significant subsystem.                  |
|                            | If there are any failures in these systems, they will be handled as part of their development stage,                           |
|                            | or over the Easter break.                                                                                                      |
| End of Stage Verification  | To be conducted at the end of each stage.                                                                                      |
| System and User Acceptance | To be concluded at the end of my user testing stage (Stage 8)                                                                  |
|----------------------------+--------------------------------------------------------------------------------------------------------------------------------|
#+end_table

* Legal, Social, Ethical and Professional Issues
  The main ethical issue with my project is the storage of users private keys which means their funds.
  To mitigate the issues with this I will be utilising the encryption libraries available on Android alongside making sure that the private key never leaves the device.
  Alongside these issues there may be potentially other issues with losing funds, for example if the user cannot send funds, said funds may become stuck on the device. 
  The main social issues here are that users addresses may be released without them wanting to, therefore allowing people to see the transactions they have made on the blockchain.
  In order to mitigate this issue, I will make sure the addresses are only shared when the user copies and pastes them themselves.
