other-paperwork/pid/pid.html


<div id="outline-container-org7d3e2e9" class="outline-2">
<h2 id="org7d3e2e9"><span class="section-number-2">9</span> Initial Risk List</h2>
<div class="outline-text-2" id="text-9">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Risk</th>
<th scope="col" class="org-left">Management Strategy</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Technology failure, loss of data</td>
<td class="org-left">In the event that I have a technology failure I will be using Git as my version control system</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">while also using Github as a repository hosting solution</td>
</tr>

<tr>
<td class="org-left">Schedule Overrun</td>
<td class="org-left">Schedule Overrun has been considered as part of this project, I have left time free during my</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Easter break (08/04/19 to 28/04/19) to be used to catch up with any overrun if it is needed</td>
</tr>

<tr>
<td class="org-left">Difficultly learning how to use the development technologies</td>
<td class="org-left">As I have not developed a blockchain application or developed with Kotlin before, but as I feel</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">I am a competent developer I should be able to utilise the extensive documentation online to overcome this issue.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">I have also planned for overrun in my project plan which will allow me to catch up if needed</td>
</tr>

<tr>
<td class="org-left">Illness, family emergency</td>
<td class="org-left">In the event of illness or family emergency, I will contact my project supervisor.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">If necessary I will apply for extenuating circumstances.</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-org8ae102c" class="outline-2">
<h2 id="org8ae102c"><span class="section-number-2">10</span> Initial Quality Plan</h2>
<div class="outline-text-2" id="text-10">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Quality Check</th>
<th scope="col" class="org-left">Strategy</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Requirements</td>
<td class="org-left">Requirements will be checked reviewed to check they are correct and adhere to the project objectives as well as being correct,</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">complete and, achievable as these requirements will indicate the criteria of the resulting product.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Prototypes will be built and assessed by other stakeholders (friends, users and colleagues)</td>
</tr>

<tr>
<td class="org-left">Design Validation</td>
<td class="org-left">Throughout the project I will constantly evaluate the project on the delivery of every significant subsystem.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">If there are any failures in these systems, they will be handled as part of their development stage,</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">or over the Easter break.</td>
</tr>

<tr>
<td class="org-left">End of Stage Verification</td>
<td class="org-left">To be conducted at the end of each stage.</td>
</tr>

<tr>
<td class="org-left">System and User Acceptance</td>
<td class="org-left">To be concluded at the end of my user testing stage (Stage 8)</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-orgb69403d" class="outline-2">
<h2 id="orgb69403d"><span class="section-number-2">11</span> Legal, Social, Ethical and Professional Issues</h2>
<div class="outline-text-2" id="text-11">
<p>
The main ethical issue with my project is the storage of users private keys which means their funds.
To mitigate the issues with this I will be utilising the encryption libraries available on Android alongside making sure that the private key never leaves the device.
Alongside these issues there may be potentially other issues with losing funds, for example if the user cannot send funds, said funds may become stuck on the device. 
The main social issues here are that users addresses may be released without them wanting to, therefore allowing people to see the transactions they have made on the blockchain.
In order to mitigate this issue, I will make sure the addresses are only shared when the user copies and pastes them themselves.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Benjamin Moore</p>
<p class="date">Created: 2018-12-11 Tue 15:25</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
